const bankObj = {
  ธนาคารกรุงเทพ: {
    bankCode: "002",
    name: "ธนาคารกรุงเทพ",
  },
  ธนาคารกสิกรไทย: {
    bankCode: "004",
    name: "ธนาคารกสิกรไทย",
  },
  ธนาคารกรุงไทย: {
    bankCode: "006",
    name: "ธนาคารกรุงไทย",
  },
  ธนาคารทหารไทย: {
    bankCode: "011",
    name: "ธนาคารทหารไทย",
  },
  ธนาคารไทยพาณิชย์: {
    bankCode: "014",
    name: "ธนาคารไทยพาณิชย์",
  },
  ธนาคารกรุงศรีอยุธยา: {
    bankCode: "025",
    name: "ธนาคารกรุงศรีอยุธยา",
  },
  ธนาคารเกียรตินาคินภัทร: {
    bankCode: "069",
    name: "ธนาคารเกียรตินาคินภัทร",
  },
  ธนาคารซีไอเอ็มบีไทย: {
    bankCode: "022",
    name: "ธนาคารซีไอเอ็มบีไทย",
  },
  ธนาคารทิสโก้: {
    bankCode: "067",
    name: "ธนาคารทิสโก้",
  },
  ธนาคารธนชาต: {
    bankCode: "065",
    name: "ธนาคารธนชาต",
  },
  ธนาคารยูโอบี: {
    bankCode: "024",
    name: "ธนาคารยูโอบี",
  },
  ธนาคารไทยเครดิตเพื่อรายย่อย: {
    bankCode: "071",
    name: "ธนาคารไทยเครดิตเพื่อรายย่อย",
  },
  "ธนาคารแลนด์แอนด์ เฮ้าส์": {
    bankCode: "073",
    name: "ธนาคารแลนด์แอนด์ เฮ้าส์",
  },
  "ธนาคารไอซีบีซี (ไทย)": {
    bankCode: "070",
    name: "ธนาคารไอซีบีซี (ไทย)",
  },
  ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย: {
    bankCode: "098",
    name: "ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย",
  },
  ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร: {
    bankCode: "034",
    name: "ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร",
  },
  ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย: {
    bankCode: "035",
    name: "ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย",
  },
  ธนาคารออมสิน: {
    bankCode: "030",
    name: "ธนาคารออมสิน",
  },
  ธนาคารอาคารสงเคราะห์: {
    bankCode: "033",
    name: "ธนาคารอาคารสงเคราะห์",
  },
  ธนาคารอิสลามแห่งประเทศไทย: {
    bankCode: "066",
    name: "ธนาคารอิสลามแห่งประเทศไทย",
  },
  "ธนาคารเมกะ สากลพาณิชย์": {
    bankCode: "026",
    name: "ธนาคารเมกะ สากลพาณิชย์",
  },
  "ธนาคารแห่งประเทศจีน (ไทย)": {
    bankCode: "052",
    name: "ธนาคารแห่งประเทศจีน (ไทย)",
  },
  "ธนาคารเอเอ็นแซด (ไทย)": {
    bankCode: "079",
    name: "ธนาคารเอเอ็นแซด (ไทย)",
  },
  "ธนาคารซูมิโตโม มิตซุย ทรัสต์ (ไทย)": {
    bankCode: "080",
    name: "ธนาคารซูมิโตโม มิตซุย ทรัสต์ (ไทย)",
  },
  ธนาคารซิตี้แบงค์: {
    bankCode: "017",
    name: "ธนาคารซิตี้แบงค์",
  },
};

module.exports = {
  bankObj,
};
