export default [
  {
    bankCode: '002',
    name: 'ธนาคารกรุงเทพ',
  },
  {
    bankCode: '004',
    name: 'ธนาคารกสิกรไทย',
  },
  {
    bankCode: '006',
    name: 'ธนาคารกรุงไทย',
  },
  {
    bankCode: '011',
    name: 'ธนาคารทหารไทย',
  },
  {
    bankCode: '014',
    name: 'ธนาคารไทยพาณิชย์',
  },
  {
    bankCode: '025',
    name: 'ธนาคารกรุงศรีอยุธยา',
  },
  {
    bankCode: '069',
    name: 'ธนาคารเกียรตินาคินภัทร',
  },
  {
    bankCode: '022',
    name: 'ธนาคารซีไอเอ็มบีไทย',
  },
  {
    bankCode: '067',
    name: 'ธนาคารทิสโก้',
  },
  {
    bankCode: '065',
    name: 'ธนาคารธนชาต',
  },
  {
    bankCode: '024',
    name: 'ธนาคารยูโอบี',
  },
  {
    bankCode: '071',
    name: 'ธนาคารไทยเครดิตเพื่อรายย่อย',
  },
  {
    bankCode: '073',
    name: 'ธนาคารแลนด์แอนด์ เฮ้าส์',
  },
  {
    bankCode: '070',
    name: 'ธนาคารไอซีบีซี (ไทย)',
  },
  {
    bankCode: '098',
    name: 'ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย',
  },
  {
    bankCode: '034',
    name: 'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร',
  },
  {
    bankCode: '035',
    name: 'ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย',
  },
  {
    bankCode: '030',
    name: 'ธนาคารออมสิน',
  },
  {
    bankCode: '033',
    name: 'ธนาคารอาคารสงเคราะห์',
  },
  {
    bankCode: '066',
    name: 'ธนาคารอิสลามแห่งประเทศไทย',
  },
  {
    bankCode: '026',
    name: 'ธนาคารเมกะ สากลพาณิชย์',
  },
  {
    bankCode: '052',
    name: 'ธนาคารแห่งประเทศจีน (ไทย)',
  },
  {
    bankCode: '079',
    name: 'ธนาคารเอเอ็นแซด (ไทย)',
  },
  {
    bankCode: '080',
    name: 'ธนาคารซูมิโตโม มิตซุย ทรัสต์ (ไทย)',
  },
  {
    bankCode: '017',
    name: 'ธนาคารซิตี้แบงค์',
  },
  {
    bankCode: '007',
    name: 'ธนาคารสแตนดาร์ดชาร์เตอร์ด',
  },
];
